In [3]:
import numpy as np

In [4]:
import pandas as pd

In [43]:
data = np.random.randn(4,3)

In [44]:
data

array([[ 1.42232772, -1.63898949,  0.84657618],
       [-0.30741674, -0.80430859,  0.06415125],
       [-0.84440695, -1.97151035,  1.37341693],
       [ 0.77293173, -0.49857041, -0.61723496]])

In [45]:
data_frame=pd.DataFrame(data)

In [46]:
data_frame

          0         1         2
0  1.422328 -1.638989  0.846576
1 -0.307417 -0.804309  0.064151
2 -0.844407 -1.971510  1.373417
3  0.772932 -0.498570 -0.617235

In [47]:
type(data_frame)

pandas.core.frame.DataFrame

In [48]:
data_frame[0]

0    1.422328
1   -0.307417
2   -0.844407
3    0.772932
Name: 0, dtype: float64

In [49]:
type(data_frame[0])

pandas.core.series.Series

In [50]:
new_df = pd.DataFrame(data, index=["Uzeyir","Zeynep","Atlas","Mehmet"],columns=["Salary","Age","Seniority"])

In [51]:
new_df

          Salary       Age  Seniority
Uzeyir  1.422328 -1.638989   0.846576
Zeynep -0.307417 -0.804309   0.064151
Atlas  -0.844407 -1.971510   1.373417
Mehmet  0.772932 -0.498570  -0.617235

In [52]:
new_df["Age"]

Uzeyir   -1.638989
Zeynep   -0.804309
Atlas    -1.971510
Mehmet   -0.498570
Name: Age, dtype: float64

In [53]:
new_df["Salary"]

Uzeyir    1.422328
Zeynep   -0.307417
Atlas    -0.844407
Mehmet    0.772932
Name: Salary, dtype: float64

In [56]:
new_df[["Age","Salary"]]

             Age    Salary
Uzeyir -1.638989  1.422328
Zeynep -0.804309 -0.307417
Atlas  -1.971510 -0.844407
Mehmet -0.498570  0.772932

In [58]:
new_df.loc["Uzeyir"]

Salary       1.422328
Age         -1.638989
Seniority    0.846576
Name: Uzeyir, dtype: float64

In [59]:
new_df.iloc[0]

Salary       1.422328
Age         -1.638989
Seniority    0.846576
Name: Uzeyir, dtype: float64

In [60]:
new_df

          Salary       Age  Seniority
Uzeyir  1.422328 -1.638989   0.846576
Zeynep -0.307417 -0.804309   0.064151
Atlas  -0.844407 -1.971510   1.373417
Mehmet  0.772932 -0.498570  -0.617235

In [61]:
new_df.iloc[:,1]

Uzeyir   -1.638989
Zeynep   -0.804309
Atlas    -1.971510
Mehmet   -0.498570
Name: Age, dtype: float64

In [64]:
new_df["Extra"]=10

In [65]:
new_df

          Salary       Age  Seniority  Extra
Uzeyir  1.422328 -1.638989   0.846576     10
Zeynep -0.307417 -0.804309   0.064151     10
Atlas  -0.844407 -1.971510   1.373417     10
Mehmet  0.772932 -0.498570  -0.617235     10

In [71]:
new_df.drop("Extra",axis=1,inplace=True)

In [73]:
new_df.loc["Atlas"]

Salary      -0.844407
Age         -1.971510
Seniority    1.373417
Name: Atlas, dtype: float64

In [74]:
new_df.loc["Atlas"]["Salary"]

-0.8444069481410029

In [75]:
new_df.loc["Atlas","Salary"]

-0.8444069481410029

In [77]:
new_df.loc["Atlas","Salary"]=100

In [78]:
new_df

            Salary       Age  Seniority
Uzeyir    1.422328 -1.638989   0.846576
Zeynep   -0.307417 -0.804309   0.064151
Atlas   100.000000 -1.971510   1.373417
Mehmet    0.772932 -0.498570  -0.617235

In [80]:
new_df>0

        Salary    Age  Seniority
Uzeyir    True  False       True
Zeynep   False  False       True
Atlas     True  False       True
Mehmet    True  False      False

In [81]:
boolean_frame=new_df>0

In [82]:
new_df[boolean_frame]

            Salary  Age  Seniority
Uzeyir    1.422328  NaN   0.846576
Zeynep         NaN  NaN   0.064151
Atlas   100.000000  NaN   1.373417
Mehmet    0.772932  NaN        NaN

In [83]:
new_df[new_df>0]

            Salary  Age  Seniority
Uzeyir    1.422328  NaN   0.846576
Zeynep         NaN  NaN   0.064151
Atlas   100.000000  NaN   1.373417
Mehmet    0.772932  NaN        NaN

In [84]:
new_df[new_df["Salary"]>1]

            Salary       Age  Seniority
Uzeyir    1.422328 -1.638989   0.846576
Atlas   100.000000 -1.971510   1.373417

In [87]:
new_df[new_df["Age"]>-1]

          Salary       Age  Seniority
Zeynep -0.307417 -0.804309   0.064151
Mehmet  0.772932 -0.498570  -0.617235

In [88]:
new_df

            Salary       Age  Seniority
Uzeyir    1.422328 -1.638989   0.846576
Zeynep   -0.307417 -0.804309   0.064151
Atlas   100.000000 -1.971510   1.373417
Mehmet    0.772932 -0.498570  -0.617235

In [89]:
new_df.reset_index()

    index      Salary       Age  Seniority
0  Uzeyir    1.422328 -1.638989   0.846576
1  Zeynep   -0.307417 -0.804309   0.064151
2   Atlas  100.000000 -1.971510   1.373417
3  Mehmet    0.772932 -0.498570  -0.617235

In [91]:
reset_frame=new_df.reset_index()

In [92]:
reset_frame

    index      Salary       Age  Seniority
0  Uzeyir    1.422328 -1.638989   0.846576
1  Zeynep   -0.307417 -0.804309   0.064151
2   Atlas  100.000000 -1.971510   1.373417
3  Mehmet    0.772932 -0.498570  -0.617235

In [94]:
reset_frame.loc[0]

index          Uzeyir
Salary       1.422328
Age         -1.638989
Seniority    0.846576
Name: 0, dtype: object

In [95]:
new_indices=["Uzo","Zey","Atl","Meh"]

In [96]:
new_df["NewIndex"]=new_indices

In [97]:
new_df

            Salary       Age  Seniority NewIndex
Uzeyir    1.422328 -1.638989   0.846576      Uzo
Zeynep   -0.307417 -0.804309   0.064151      Zey
Atlas   100.000000 -1.971510   1.373417      Atl
Mehmet    0.772932 -0.498570  -0.617235      Meh

In [98]:
new_df.set_index("NewIndex",inplace=True)

In [99]:
new_df

              Salary       Age  Seniority
NewIndex
Uzo         1.422328 -1.638989   0.846576
Zey        -0.307417 -0.804309   0.064151
Atl       100.000000 -1.971510   1.373417
Meh         0.772932 -0.498570  -0.617235

In [101]:
new_df.loc["Uzo"]

Salary       1.422328
Age         -1.638989
Seniority    0.846576
Name: Uzo, dtype: float64

In [102]:
# multi index

In [103]:
first_index=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [104]:
inner_index=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [106]:
zipped_index=list(zip(first_index,inner_index))

In [107]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [108]:
zipped_index=pd.MultiIndex.from_tuples(zipped_index)

In [109]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [112]:
sample_values=np.ones((6,2))

In [113]:
big_df=pd.DataFrame(sample_values, index=zipped_index,columns=["Age","Salary"])

In [119]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [114]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [117]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [118]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64